In [1]:
import pandas as pd
from datetime import datetime
import matplotlib.pyplot as plt
from datetime import date, timedelta

In [2]:
df = pd.read_csv(r'C:/Users/souzag31/OneDrive - Heineken International/Gustavo Souza de Almeida/PBI/IM/Ironman World Championship.csv', encoding = 'latin1')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252 entries, 0 to 251
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Year     252 non-null    int64
 1   Place    252 non-null    int64
 2   Athlete  252 non-null    object
 3   Country  252 non-null    object
 4   Time     252 non-null    object
 5   Gender   252 non-null    object
dtypes: int64(2), object(4)
memory usage: 11.9+ KB

In [4]:
df.columns

Index(['Year', 'Place', 'Athlete', 'Country', 'Time', 'Gender'], dtype='object')

In [5]:
df.head()

   Year  Place        Athlete Country     Time Gender
0  2019      1    Jan Frodeno     GER  7:51:13   Male
1  2018      1  Patrick Lange     GER  7:52:39   Male
2  2017      1  Patrick Lange     GER  8:01:40   Male
3  2016      1    Jan Frodeno     GER  8:06:30   Male
4  2015      1    Jan Frodeno     GER  8:14:40   Male

In [6]:
df['time_hour'] = pd.to_datetime(df['Time'], format = '%H:%M:%S').dt.time
df.head()

   Year  Place        Athlete Country     Time Gender time_hour
0  2019      1    Jan Frodeno     GER  7:51:13   Male  07:51:13
1  2018      1  Patrick Lange     GER  7:52:39   Male  07:52:39
2  2017      1  Patrick Lange     GER  8:01:40   Male  08:01:40
3  2016      1    Jan Frodeno     GER  8:06:30   Male  08:06:30
4  2015      1    Jan Frodeno     GER  8:14:40   Male  08:14:40

# Top 10 atletas homens com mais participações em mundial

In [7]:
df_male = df[df['Gender']== 'Male']

num_races_men = df_male.groupby('Athlete')['Year'].count()

num_races_men.sort_values(ascending = False).nlargest(10)

Athlete
Dave Scott           9
Mark Allen           9
Scott Tinley         8
Peter Reid           7
Andreas Raelert      5
Thomas Hellriegel    4
Jan Frodeno          4
Tim DeBoom           4
Craig Alexander      4
Greg Welch           4
Name: Year, dtype: int64

# Top 10 atletas mulheres com mais participações em mundial

In [8]:
df_female = df[df['Gender']== 'Female']

num_races_women = df_female.groupby('Athlete')['Year'].count()

num_races_women.sort_values(ascending = False).nlargest(10)

Athlete
Paula Newby-Fraser     10
Natascha Badmann        8
Mirinda Carfrae         7
Lori Bowden             7
Fernanda Keller         6
Sylviane Puntous        5
Daniela Ryf             5
Erin Baker              5
Karen Smyers            4
Chrissie Wellington     4
Name: Year, dtype: int64

# Países com maior número de atletas em pódio

In [9]:
races_per_country = df.groupby('Country')['Year'].count()

races_per_country.sort_values(ascending = False)

Country
USA    81
GER    37
AUS    29
CAN    27
GBR    18
SUI    16
ZIM    10
BEL     9
NZL     9
BRA     6
FIN     3
ESP     2
NED     2
CHI     1
DEN     1
FRA     1
Name: Year, dtype: int64

# Atletas masculinos que mais venceram

In [24]:
first = (df['Place'] == 1) & (df['Gender'] == "Male")
first_count = df[first].groupby('Athlete').size().reset_index(name = 'count')
first_count.sort_values(by = 'count', ascending = False).head(10)

            Athlete  count
10       Mark Allen      6
2        Dave Scott      6
1   Craig Alexander      3
14       Peter Reid      3
7       Jan Frodeno      3
19       Tim DeBoom      2
16     Scott Tinley      2
12    Patrick Lange      2
11  Normann Stadler      2
0   Chris McCormack      2

In [26]:
first_women = (df['Place'] == 1) & (df['Gender'] == "Female")
first_women_count = df[first_women].groupby('Athlete').size().reset_index(name = 'count')
first_women_count.sort_values(by = 'count', ascending = False).head(10)

                Athlete  count
16   Paula Newby-Fraser      7
15     Natascha Badmann      6
2           Daniela Ryf      4
1   Chrissie Wellington      4
14      Mirinda Carfrae      3
19     Sylviane Puntous      2
3            Erin Baker      2
11          Lori Bowden      2
12          Lyn Lemaire      1
18           Robin Beck      1